Repository: mohamedabubasith/food-delivery
Catalog: frontend/lib/src/l10n/app_*.arb
Languages: ta

# appName
source: Local Eats
ta: லோக்கல் ஈட்ஸ் (Local Eats)

# welcomeTitle
source: Welcome to Local Eats
ta: லோக்கல் ஈட்ஸ்-க்கு உங்களை வரவேற்கிறோம்

# welcomeSubtitle
source: Order delicious food from local restaurants.
ta: உள்ளூர் உணவகங்களில் இருந்து சுவையான உணவை ஆர்டர் செய்யுங்கள்.

source: Phone Number
ta: கைபேசி எண்

# phoneHint
source: Enter a valid 10-digit number
ta: சரியான 10 இலக்க எண்ணை உள்ளிடவும்

# continueButton
source: Continue
ta: தொடரவும்

# termsText
source: By continuing, you agree to our Terms & Privacy Policy.
ta: தொடர்வதன் மூலம், எங்கள் விதிமுறைகள் மற்றும் தனியுரிமைக் கொள்கையை ஏற்கிறீர்கள்.

source: Verification
ta: சரிபார்ப்பு

# enterOtp
source: Enter the OTP sent to {phone}
ta: {phone}-க்கு அனுப்பப்பட்ட OTP-ஐ உள்ளிடவும்

# verifyButton
source: Verify & Login
ta: சரிபார்த்து உள்நுழையவும்

# resendCodeIn
source: Resend code in 00:{time}
ta: 00:{time} வினாடிகளில் மீண்டும் அனுப்பு

source: Resend Code
ta: மீண்டும் குறியீட்டை அனுப்பு

source: Login Successful
ta: வெற்றிகரமாக உள்நுழைந்தீர்கள்

# codeSent
source: Verification code sent
ta: சரிபார்ப்புக் குறியீடு அனுப்பப்பட்டது

# invalidCode
source: Invalid verification code
ta: தவறான சரிபார்ப்புக் குறியீடு

# homeTitle
source: Home Screen (BLoC Edition)
ta: முகப்புத் திரை (BLoC பதிப்பு)

# completeProfile
source: Complete Your Profile
ta: உங்கள் சுயவிவரத்தை நிறைவு செய்யுங்கள்

source: What's your name?
ta: உங்கள் பெயர் என்ன?

# personalizeName
source: This helps us personalize your experience
ta: இது உங்கள் அனுபவத்தைத் தனிப்பயனாக்க உதவுகிறது

source: Full Name
ta: முழுப் பெயர்

source: Enter your name
ta: உங்கள் பெயரை உள்ளிடவும்

# pleaseEnterName
source: Please enter your name
ta: தயவுசெய்து உங்கள் பெயரை உள்ளிடவும்

# nameMinLength
source: Name must be at least 2 characters
ta: பெயர் குறைந்தது 2 எழுத்துக்களாக இருக்க வேண்டும்

source: Welcome!
ta: வரவேற்பு!

source: Continue with Google
ta: Google மூலம் தொடரவும்

# googleSignInSuccess
source: Google Sign-In successful
ta: Google உள்நுழைவு வெற்றிகரமாக முடிந்தது

# invalidOtpCode
source: Invalid verification code. Please try again.
ta: தவறான சரிபார்ப்புக் குறியீடு. மீண்டும் முயற்சிக்கவும்.

# otpExpired
source: Verification code expired. Please request a new code.
ta: சரிபார்ப்புக் குறியீடு காலாவதியானது. புதிய குறியீட்டைக் கோரவும்.

# tooManyRequests
source: Too many attempts. Please try again later.
ta: பல முயற்சிகள். சிறிது நேரம் கழித்து முயற்சிக்கவும்.

# phoneNumberInvalid
source: Invalid phone number format.
ta: தவறான தொலைபேசி எண் வடிவம்.

# verificationFailed
source: Verification failed. Please try again.
ta: சரிபார்ப்பு தோல்வியடைந்தது. மீண்டும் முயற்சிக்கவும்.

source: Email Address
ta: மின்னஞ்சல் முகவரி

source: Password
ta: கடவுச்சொல்

source: Sign In
ta: உள்நுழைக

source: Sign Up
ta: பதிவு செய்க

source: Continue with Email
ta: மின்னஞ்சல் மூலம் தொடரவும்

source: New user?
ta: புதிய பயனரா?

# alreadyHaveAccount
source: Already have an account?
ta: ஏற்கனவே கணக்கு உள்ளதா?

# invalidEmail
source: Invalid email address
ta: தவறான மின்னஞ்சல் முகவரி

# weakPassword
source: Password is too weak (min 6 characters)
ta: கடவுச்சொல் மிகவும் எளிதானது (குறைந்தது 6 எழுத்துக்கள்)

source: Email already in use
ta: மின்னஞ்சல் ஏற்கனவே பயன்பாட்டில் உள்ளது

# wrongPassword
source: Incorrect password
ta: தவறான கடவுச்சொல்

# userNotFound
source: No account found with this email
ta: இந்த மின்னஞ்சலுடன் கணக்கு இல்லை

# emailSignInSuccess
source: Login successful!
ta: நுழைவு வெற்றிகரமாக முடிந்தது!

# errorEmailInUse
source: Account exists. Please sign in or use Google if you used it before.
ta: கணக்கு உள்ளது. தயவுசெய்து உள்நுழையவும் அல்லது Google மூலம் முயற்சிக்கவும்.

# errorWrongPassword
source: Incorrect password. If you used Google, please sign in with Google.
ta: தவறான கடவுச்சொல். நீங்கள் Google ஐப் பயன்படுத்தியிருந்தால், தயவுசெய்து Google மூலம் உள்நுழையவும்.
